{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "modelo_numeros",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 28, 28, 1],
              "dtype": "float32",
              "name": "entrada"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "valid",
              "name": "conv1"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "name": "pool1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 64,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "valid",
              "name": "conv2"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "name": "pool2"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 128,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "valid",
              "name": "conv3"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "name": "pool3"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.5,
              "name": "dropout"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 512,
              "activation": "relu",
              "name": "densa"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 10,
              "activation": "softmax",
              "name": "salida"
            }
          }
        ]
      }
    }
  },
  "training_config": {
    "loss": {
      "class_name": "SparseCategoricalCrossentropy",
      "config": {
        "from_logits": false
      }
    },
    "metrics": ["accuracy"],
    "optimizer_config": {
      "class_name": "Adam",
      "config": {
        "learning_rate": 0.001
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "conv1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "conv1/bias", "shape": [32], "dtype": "float32" },

        { "name": "conv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "conv2/bias", "shape": [64], "dtype": "float32" },

        { "name": "conv3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32" },
        { "name": "conv3/bias", "shape": [128], "dtype": "float32" },

        { "name": "densa/kernel", "shape": [128, 512], "dtype": "float32" },
        { "name": "densa/bias", "shape": [512], "dtype": "float32" },

        { "name": "salida/kernel", "shape": [512, 10], "dtype": "float32" },
        { "name": "salida/bias", "shape": [10], "dtype": "float32" }
      ]
    }
  ]
}
